OpenNuvoton/MS51BSP_KEIL/MS51FC0AE_MS51XC0BE_MS51EB0AE_MS51EC0AE_MS51TC0AE_MS51PC0AE/Library/Device/Include/Function_Define_MS51_32K.h
#define    DISABLE_UART4_RXD_DEGLITCH         clr_AUXR6_UART4DG
#define    DISABLE_UART3_RXD_DEGLITCH         clr_AUXR6_UART3DG
#define    DISABLE_UART2_RXD_DEGLITCH         clr_AUXR6_UART2DG
#define    DISABLE_UART1_RXD_DEGLITCH         clr_AUXR6_UART1DG
#define    DISABLE_UART0_RXD_DEGLITCH         clr_AUXR6_UART0DG

/****************************************************************************************/
/* INT0 setting                                                                         */
/****************************************************************************************/
#define    INT0_FALLING_EDGE_TRIG             set_TCON_IT0  //TBD
#define    INT0_LOW_LEVEL_TRIG                clr_TCON_IT0  //TBD

/****************************************************************************************/
/* INT1 setting                                                                         */
/****************************************************************************************/
#define    INT1_FALLING_EDGE_TRIG             set_TCON_IT1  //Check
#define    INT1_LOW_LEVEL_TRIG                clr_TCON_IT1  //Check

/*****************************************************************************************
* WDT setting
*****************************************************************************************/
#define    WDT_TIMEOUT_6MS                    TA=0xAA;TA=0x55;WDCON&=0xF8
#define    WDT_TIMEOUT_25MS                   TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x01
#define    WDT_TIMEOUT_50MS                   TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x02
#define    WDT_TIMEOUT_100MS                  TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x03
#define    WDT_TIMEOUT_200MS                  TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x04
#define    WDT_TIMEOUT_400MS                  TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x05
#define    WDT_TIMEOUT_800MS                  TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x06
#define    WDT_TIMEOUT_1_6S                   TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x07

#define    WDT_RUN_IN_POWERDOWN_ENABLE        set_WDCON_WIDPD
#define    WDT_RUN_IN_POWERDOWN_DISABLE       clr_WDCON_WIDPD
#define    WDT_COUNTER_CLEAR                  set_WDCON_WDCLR
#define    WDT_COUNTER_RUN                    set_WDCON_WDTR

/*************************************************************************/
/*   PIN interrupt define                                                */
/*************************************************************************/
//---------------- Pin interrupt channel 0 PIT0 ------------------------
#define    ENABLE_PIT0_P00_LOWLEVEL          SFRS=2;PIPS0=0x00;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P01_LOWLEVEL          SFRS=2;PIPS0=0x01;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P02_LOWLEVEL          SFRS=2;PIPS0=0x02;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P03_LOWLEVEL          SFRS=2;PIPS0=0x03;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P04_LOWLEVEL          SFRS=2;PIPS0=0x04;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P05_LOWLEVEL          SFRS=2;PIPS0=0x05;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P06_LOWLEVEL          SFRS=2;PIPS0=0x06;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P07_LOWLEVEL          SFRS=2;PIPS0=0x07;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P10_LOWLEVEL          SFRS=2;PIPS0=0x10;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P11_LOWLEVEL          SFRS=2;PIPS0=0x11;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P12_LOWLEVEL          SFRS=2;PIPS0=0x12;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P13_LOWLEVEL          SFRS=2;PIPS0=0x13;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P14_LOWLEVEL          SFRS=2;PIPS0=0x14;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P15_LOWLEVEL          SFRS=2;PIPS0=0x15;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P16_LOWLEVEL          SFRS=2;PIPS0=0x16;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P17_LOWLEVEL          SFRS=2;PIPS0=0x17;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P20_LOWLEVEL          SFRS=2;PIPS0=0x20;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P21_LOWLEVEL          SFRS=2;PIPS0=0x21;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P22_LOWLEVEL          SFRS=2;PIPS0=0x22;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P23_LOWLEVEL          SFRS=2;PIPS0=0x23;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P24_LOWLEVEL          SFRS=2;PIPS0=0x24;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P25_LOWLEVEL          SFRS=2;PIPS0=0x25;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P30_LOWLEVEL          SFRS=2;PIPS0=0x30;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P31_LOWLEVEL          SFRS=2;PIPS0=0x31;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P32_LOWLEVEL          SFRS=2;PIPS0=0x32;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P33_LOWLEVEL          SFRS=2;PIPS0=0x33;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P34_LOWLEVEL          SFRS=2;PIPS0=0x34;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P35_LOWLEVEL          SFRS=2;PIPS0=0x35;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P36_LOWLEVEL          SFRS=2;PIPS0=0x36;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0
#define    ENABLE_PIT0_P37_LOWLEVEL          SFRS=2;PIPS0=0x37;SFRS=0;PICON&=CLR_BIT0;PINEN|=SET_BIT0;PIPEN&=CLR_BIT0

