OpenNuvoton/MS51BSP_KEIL/MS51FC0AE_MS51XC0BE_MS51EB0AE_MS51EC0AE_MS51TC0AE_MS51PC0AE/Library/Device/Include/Function_Define_MS51_32K.h
#define    DISABLE_ALL_PIT                   SFRS=2;PIPS0=0;PIPS1=0;PIPS2=0;PIPS3=0;PIPS4=0; \
                                                    PIPS5=0;PIPS6=0;PIPS7=0; \
                                                    SFRS=0;PICON=0;PINEN=0;PIPEN=0

/*****************************************************************************************/
/* For GPIO Mode setting                                                                 */
/*****************************************************************************************/
/*------------------- Define Port as Quasi mode  -------------------*/
#define    P00_QUASI_MODE         SFRS=0;P0M1&=0xFE;P0M2&=0xFE
#define    P01_QUASI_MODE         SFRS=0;P0M1&=0xFD;P0M2&=0xFD
#define    P02_QUASI_MODE         SFRS=0;P0M1&=0xFB;P0M2&=0xFB
#define    P03_QUASI_MODE         SFRS=0;P0M1&=0xF7;P0M2&=0xF7
#define    P04_QUASI_MODE         SFRS=0;P0M1&=0xEF;P0M2&=0xEF
#define    P05_QUASI_MODE         SFRS=0;P0M1&=0xDF;P0M2&=0xDF
#define    P06_QUASI_MODE         SFRS=0;P0M1&=0xBF;P0M2&=0xBF
#define    P07_QUASI_MODE         SFRS=0;P0M1&=0x7F;P0M2&=0x7F
#define    P10_QUASI_MODE         SFRS=0;P1M1&=0xFE;P1M2&=0xFE
#define    P11_QUASI_MODE         SFRS=0;P1M1&=0xFD;P1M2&=0xFD
#define    P12_QUASI_MODE         SFRS=0;P1M1&=0xFB;P1M2&=0xFB
#define    P13_QUASI_MODE         SFRS=0;P1M1&=0xF7;P1M2&=0xF7
#define    P14_QUASI_MODE         SFRS=0;P1M1&=0xEF;P1M2&=0xEF
#define    P15_QUASI_MODE         SFRS=0;P1M1&=0xDF;P1M2&=0xDF
#define    P16_QUASI_MODE         SFRS=0;P1M1&=0xBF;P1M2&=0xBF
#define    P17_QUASI_MODE         SFRS=0;P1M1&=0x7F;P1M2&=0x7F
#define    P20_QUASI_MODE         SFRS=2;P2M1&=0xFE;P2M2&=0xFE
#define    P21_QUASI_MODE         SFRS=2;P2M1&=0xFD;P2M2&=0xFD
#define    P22_QUASI_MODE         SFRS=2;P2M1&=0xFB;P2M2&=0xFB
#define    P23_QUASI_MODE         SFRS=2;P2M1&=0xF7;P2M2&=0xF7
#define    P24_QUASI_MODE         SFRS=2;P2M1&=0xEF;P2M2&=0xEF
#define    P25_QUASI_MODE         SFRS=2;P2M1&=0xDF;P2M2&=0xDF
#define    P30_QUASI_MODE         SFRS=0;P3M1&=0xFE;P3M2&=0xFE
#define    P31_QUASI_MODE         SFRS=0;P3M1&=0xFD;P3M2&=0xFD
#define    P32_QUASI_MODE         SFRS=0;P3M1&=0xFB;P3M2&=0xFB
#define    P33_QUASI_MODE         SFRS=0;P3M1&=0xF7;P3M2&=0xF7
#define    P34_QUASI_MODE         SFRS=0;P3M1&=0xEF;P3M2&=0xEF
#define    P35_QUASI_MODE         SFRS=0;P3M1&=0xDF;P3M2&=0xDF
#define    P36_QUASI_MODE         SFRS=0;P3M1&=0xBF;P3M2&=0xBF
#define    P37_QUASI_MODE         SFRS=0;P3M1&=0x7F;P3M2&=0x7F
#define    ALL_GPIO_QUASI_MODE         SFRS=0;P0M1=0x00;P0M2=0x00;P1M1=0x00;P1M2=0x00;\
                                       SFRS=2;P2M1=0x00;P2M2=0x00;SFRS=0;P3M1=0x00;P3M2=0x00
//------------------- Define Port as Push Pull mode -------------------*/
#define    P00_PUSHPULL_MODE      SFRS=0;P0M1&=0xFE;P0M2|=0x01
#define    P01_PUSHPULL_MODE      SFRS=0;P0M1&=0xFD;P0M2|=0x02
#define    P02_PUSHPULL_MODE      SFRS=0;P0M1&=0xFB;P0M2|=0x04
#define    P03_PUSHPULL_MODE      SFRS=0;P0M1&=0xF7;P0M2|=0x08
#define    P04_PUSHPULL_MODE      SFRS=0;P0M1&=0xEF;P0M2|=0x10
#define    P05_PUSHPULL_MODE      SFRS=0;P0M1&=0xDF;P0M2|=0x20
#define    P06_PUSHPULL_MODE      SFRS=0;P0M1&=0xBF;P0M2|=0x40
#define    P07_PUSHPULL_MODE      SFRS=0;P0M1&=0x7F;P0M2|=0x80
#define    P10_PUSHPULL_MODE      SFRS=0;P1M1&=0xFE;P1M2|=0x01
#define    P11_PUSHPULL_MODE      SFRS=0;P1M1&=0xFD;P1M2|=0x02
#define    P12_PUSHPULL_MODE      SFRS=0;P1M1&=0xFB;P1M2|=0x04
#define    P13_PUSHPULL_MODE      SFRS=0;P1M1&=0xF7;P1M2|=0x08
#define    P14_PUSHPULL_MODE      SFRS=0;P1M1&=0xEF;P1M2|=0x10
#define    P15_PUSHPULL_MODE      SFRS=0;P1M1&=0xDF;P1M2|=0x20
#define    P16_PUSHPULL_MODE      SFRS=0;P1M1&=0xBF;P1M2|=0x40
#define    P17_PUSHPULL_MODE      SFRS=0;P1M1&=0x7F;P1M2|=0x80
#define    P20_PUSHPULL_MODE      SFRS=2;P2M1&=0xFE;P2M2|=0x01
#define    P21_PUSHPULL_MODE      SFRS=2;P2M1&=0xFD;P2M2|=0x02
#define    P22_PUSHPULL_MODE      SFRS=2;P2M1&=0xFB;P2M2|=0x04
#define    P23_PUSHPULL_MODE      SFRS=2;P2M1&=0xF7;P2M2|=0x08
#define    P24_PUSHPULL_MODE      SFRS=2;P2M1&=0xEF;P2M2|=0x10
#define    P25_PUSHPULL_MODE      SFRS=2;P2M1&=0xDF;P2M2|=0x20
#define    P30_PUSHPULL_MODE      SFRS=0;P3M1&=0xFE;P3M2|=0x01
#define    P31_PUSHPULL_MODE      SFRS=0;P3M1&=0xFD;P3M2|=0x02
#define    P32_PUSHPULL_MODE      SFRS=0;P3M1&=0xFB;P3M2|=0x04
#define    P33_PUSHPULL_MODE      SFRS=0;P3M1&=0xF7;P3M2|=0x08
#define    P34_PUSHPULL_MODE      SFRS=0;P3M1&=0xEF;P3M2|=0x10
#define    P35_PUSHPULL_MODE      SFRS=0;P3M1&=0xDF;P3M2|=0x20
#define    P36_PUSHPULL_MODE      SFRS=0;P3M1&=0xBF;P3M2|=0x40
#define    P37_PUSHPULL_MODE      SFRS=0;P3M1&=0x7F;P3M2|=0x80
#define    ALL_GPIO_PUSHPULL_MODE         SFRS=0;P0M1=0x00;P0M2=0xFF;P1M1=0x00;P1M2=0xFF;\
                                          SFRS=2;P2M1=0x00;P2M2=0xFF;SFRS=0;P3M1=0x00;P3M2=0xFF
//------------------- Define Port as Input Only mode -------------------*/
#define    P00_INPUT_MODE         SFRS=0;P0M1|=0x01;P0M2&=0xFE
#define    P01_INPUT_MODE         SFRS=0;P0M1|=0x02;P0M2&=0xFD
#define    P02_INPUT_MODE         SFRS=0;P0M1|=0x04;P0M2&=0xFB
#define    P03_INPUT_MODE         SFRS=0;P0M1|=0x08;P0M2&=0xF7
#define    P04_INPUT_MODE         SFRS=0;P0M1|=0x10;P0M2&=0xEF
#define    P05_INPUT_MODE         SFRS=0;P0M1|=0x20;P0M2&=0xDF
#define    P06_INPUT_MODE         SFRS=0;P0M1|=0x40;P0M2&=0xBF
#define    P07_INPUT_MODE         SFRS=0;P0M1|=0x80;P0M2&=0x7F
#define    P10_INPUT_MODE         SFRS=0;P1M1|=0x01;P1M2&=0xFE
#define    P11_INPUT_MODE         SFRS=0;P1M1|=0x02;P1M2&=0xFD
#define    P12_INPUT_MODE         SFRS=0;P1M1|=0x04;P1M2&=0xFB
#define    P13_INPUT_MODE         SFRS=0;P1M1|=0x08;P1M2&=0xF7
#define    P14_INPUT_MODE         SFRS=0;P1M1|=0x10;P1M2&=0xEF
#define    P15_INPUT_MODE         SFRS=0;P1M1|=0x20;P1M2&=0xDF
#define    P16_INPUT_MODE         SFRS=0;P1M1|=0x40;P1M2&=0xBF
#define    P17_INPUT_MODE         SFRS=0;P1M1|=0x80;P1M2&=0x7F
#define    P20_INPUT_MODE         SFRS=2;P2M1|=0x01;P2M2&=0xFE
#define    P21_INPUT_MODE         SFRS=2;P2M1|=0x02;P2M2&=0xFD
#define    P22_INPUT_MODE         SFRS=2;P2M1|=0x04;P2M2&=0xFB
#define    P23_INPUT_MODE         SFRS=2;P2M1|=0x08;P2M2&=0xF7
#define    P24_INPUT_MODE         SFRS=2;P2M1|=0x10;P2M2&=0xEF
#define    P25_INPUT_MODE         SFRS=2;P2M1|=0x20;P2M2&=0xDF
#define    P26_INPUT_MODE         SFRS=2;P2M1|=0x40;P2M2&=0xBF
#define    P27_INPUT_MODE         SFRS=2;P2M1|=0x80;P2M2&=0x7F
#define    P30_INPUT_MODE         SFRS=0;P3M1|=0x01;P3M2&=0xFE
#define    P31_INPUT_MODE         SFRS=0;P3M1|=0x02;P3M2&=0xFD
#define    P32_INPUT_MODE         SFRS=0;P3M1|=0x04;P3M2&=0xFB
#define    P33_INPUT_MODE         SFRS=0;P3M1|=0x08;P3M2&=0xF7
#define    P34_INPUT_MODE         SFRS=0;P3M1|=0x10;P3M2&=0xEF
#define    P35_INPUT_MODE         SFRS=0;P3M1|=0x20;P3M2&=0xDF
#define    P36_INPUT_MODE         SFRS=0;P3M1|=0x40;P3M2&=0xBF
#define    P37_INPUT_MODE         SFRS=0;P3M1|=0x80;P3M2&=0x7F
#define    ALL_GPIO_INPUT_MODE         SFRS=0;P0M1=0xFF;P0M2=0x00;P1M1=0xFF;P1M2=0x00;\
                                       SFRS=2;P2M1=0xFF;P2M2=0x00;SFRS=0;P3M1=0xFF;P3M2=0x00
//-------------------Define Port as Open Drain mode -------------------*/
#define    P00_OPENDRAIN_MODE     SFRS=0;P0M1|=0x01;P0M2|=0x01
#define    P01_OPENDRAIN_MODE     SFRS=0;P0M1|=0x02;P0M2|=0x02
#define    P02_OPENDRAIN_MODE     SFRS=0;P0M1|=0x04;P0M2|=0x04
#define    P03_OPENDRAIN_MODE     SFRS=0;P0M1|=0x08;P0M2|=0x08
#define    P04_OPENDRAIN_MODE     SFRS=0;P0M1|=0x10;P0M2|=0x10
#define    P05_OPENDRAIN_MODE     SFRS=0;P0M1|=0x20;P0M2|=0x20
#define    P06_OPENDRAIN_MODE     SFRS=0;P0M1|=0x40;P0M2|=0x40
#define    P07_OPENDRAIN_MODE     SFRS=0;P0M1|=0x80;P0M2|=0x80
#define    P10_OPENDRAIN_MODE     SFRS=0;P1M1|=0x01;P1M2|=0x01
#define    P11_OPENDRAIN_MODE     SFRS=0;P1M1|=0x02;P1M2|=0x02
#define    P12_OPENDRAIN_MODE     SFRS=0;P1M1|=0x04;P1M2|=0x04
#define    P13_OPENDRAIN_MODE     SFRS=0;P1M1|=0x08;P1M2|=0x08
#define    P14_OPENDRAIN_MODE     SFRS=0;P1M1|=0x10;P1M2|=0x10
#define    P15_OPENDRAIN_MODE     SFRS=0;P1M1|=0x20;P1M2|=0x20
#define    P16_OPENDRAIN_MODE     SFRS=0;P1M1|=0x40;P1M2|=0x40
#define    P17_OPENDRAIN_MODE     SFRS=0;P1M1|=0x80;P1M2|=0x80
#define    P20_OPENDRAIN_MODE     SFRS=2;P2M1|=0x01;P2M2|=0x01
#define    P21_OPENDRAIN_MODE     SFRS=2;P2M1|=0x02;P2M2|=0x02
#define    P22_OPENDRAIN_MODE     SFRS=2;P2M1|=0x04;P2M2|=0x04
#define    P23_OPENDRAIN_MODE     SFRS=2;P2M1|=0x08;P2M2|=0x08
#define    P24_OPENDRAIN_MODE     SFRS=2;P2M1|=0x10;P2M2|=0x10
#define    P25_OPENDRAIN_MODE     SFRS=2;P2M1|=0x20;P2M2|=0x20
#define    P30_OPENDRAIN_MODE     SFRS=0;P3M1|=0x01;P3M2|=0x01
#define    P31_OPENDRAIN_MODE     SFRS=0;P3M1|=0x02;P3M2|=0x02
#define    P32_OPENDRAIN_MODE     SFRS=0;P3M1|=0x04;P3M2|=0x04
#define    P33_OPENDRAIN_MODE     SFRS=0;P3M1|=0x08;P3M2|=0x08
#define    P34_OPENDRAIN_MODE     SFRS=0;P3M1|=0x10;P3M2|=0x10
#define    P35_OPENDRAIN_MODE     SFRS=0;P3M1|=0x20;P3M2|=0x20
#define    P36_OPENDRAIN_MODE     SFRS=0;P3M1|=0x40;P3M2|=0x40
#define    P37_OPENDRAIN_MODE     SFRS=0;P3M1|=0x80;P3M2|=0x80
#define    ALL_GPIO_OPENDRAIN_MODE         SFRS=0;P0M1=0xFF;P0M2=0xFF;P1M1=0xFF;P1M2=0xFF;\
                                           SFRS=2;P2M1=0xFF;P2M2=0xFF;SFRS=0;P3M1=0xFF;P3M2=0xFF
/*****************************************************************************************/
/* For GPIO internal pull up/pull down setting                                           */
/*****************************************************************************************/
/*------------------- GPIO pull up enable -------------------*/  
#define    P00_PULLUP_ENABLE       set_P0UP_0
#define    P01_PULLUP_ENABLE       set_P0UP_1
#define    P02_PULLUP_ENABLE       set_P0UP_2
#define    P03_PULLUP_ENABLE       set_P0UP_3
#define    P04_PULLUP_ENABLE       set_P0UP_4
#define    P05_PULLUP_ENABLE       set_P0UP_5
#define    P06_PULLUP_ENABLE       set_P0UP_6
#define    P07_PULLUP_ENABLE       set_P0UP_7
#define    P10_PULLUP_ENABLE       set_P1UP_0
#define    P11_PULLUP_ENABLE       set_P1UP_1
#define    P12_PULLUP_ENABLE       set_P1UP_2
#define    P13_PULLUP_ENABLE       set_P1UP_3
#define    P14_PULLUP_ENABLE       set_P1UP_4
#define    P15_PULLUP_ENABLE       set_P1UP_5
#define    P16_PULLUP_ENABLE       set_P1UP_6
#define    P17_PULLUP_ENABLE       set_P1UP_7
#define    P20_PULLUP_ENABLE       set_P2UP_0
#define    P21_PULLUP_ENABLE       set_P2UP_1
#define    P22_PULLUP_ENABLE       set_P2UP_2
#define    P23_PULLUP_ENABLE       set_P2UP_3
#define    P24_PULLUP_ENABLE       set_P2UP_4
#define    P25_PULLUP_ENABLE       set_P2UP_5
#define    P30_PULLUP_ENABLE       set_P3UP_0
#define    P31_PULLUP_ENABLE       set_P3UP_1
#define    P32_PULLUP_ENABLE       set_P3UP_2
#define    P33_PULLUP_ENABLE       set_P3UP_3
#define    P34_PULLUP_ENABLE       set_P3UP_4
#define    P35_PULLUP_ENABLE       set_P3UP_5
#define    P36_PULLUP_ENABLE       set_P3UP_6
#define    P37_PULLUP_ENABLE       set_P3UP_7
/*------------------- GPIO pull up disable -------------------*/                              
#define    P00_PULLUP_DISABLE      clr_P0UP_0
#define    P01_PULLUP_DISABLE      clr_P0UP_1
#define    P02_PULLUP_DISABLE      clr_P0UP_2
#define    P03_PULLUP_DISABLE      clr_P0UP_3
#define    P04_PULLUP_DISABLE      clr_P0UP_4
#define    P05_PULLUP_DISABLE      clr_P0UP_5
#define    P06_PULLUP_DISABLE      clr_P0UP_6
#define    P07_PULLUP_DISABLE      clr_P0UP_7
#define    P10_PULLUP_DISABLE      clr_P1UP_0
#define    P11_PULLUP_DISABLE      clr_P1UP_1
#define    P12_PULLUP_DISABLE      clr_P1UP_2
#define    P13_PULLUP_DISABLE      clr_P1UP_3
#define    P14_PULLUP_DISABLE      clr_P1UP_4
#define    P15_PULLUP_DISABLE      clr_P1UP_5
#define    P16_PULLUP_DISABLE      clr_P1UP_6
#define    P17_PULLUP_DISABLE      clr_P1UP_7
#define    P20_PULLUP_DISABLE      clr_P2UP_0
#define    P21_PULLUP_DISABLE      clr_P2UP_1
#define    P22_PULLUP_DISABLE      clr_P2UP_2
#define    P23_PULLUP_DISABLE      clr_P2UP_3
#define    P24_PULLUP_DISABLE      clr_P2UP_4
#define    P25_PULLUP_DISABLE      clr_P2UP_5
#define    P30_PULLUP_DISABLE      clr_P3UP_0
#define    P31_PULLUP_DISABLE      clr_P3UP_1
#define    P32_PULLUP_DISABLE      clr_P3UP_2
#define    P33_PULLUP_DISABLE      clr_P3UP_3
#define    P34_PULLUP_DISABLE      clr_P3UP_4
#define    P35_PULLUP_DISABLE      clr_P3UP_5
#define    P36_PULLUP_DISABLE      clr_P3UP_6
#define    P37_PULLUP_DISABLE      clr_P3UP_7
/*------------------- GPIO pull down enable -------------------*/  
#define    P00_PULLDOWN_ENABLE     set_P0DW_0
#define    P01_PULLDOWN_ENABLE     set_P0DW_1
#define    P02_PULLDOWN_ENABLE     set_P0DW_2
#define    P03_PULLDOWN_ENABLE     set_P0DW_3
#define    P04_PULLDOWN_ENABLE     set_P0DW_4
#define    P05_PULLDOWN_ENABLE     set_P0DW_5
#define    P06_PULLDOWN_ENABLE     set_P0DW_6
#define    P07_PULLDOWN_ENABLE     set_P0DW_7
#define    P10_PULLDOWN_ENABLE     set_P1DW_0
#define    P11_PULLDOWN_ENABLE     set_P1DW_1
#define    P12_PULLDOWN_ENABLE     set_P1DW_2
#define    P13_PULLDOWN_ENABLE     set_P1DW_3
#define    P14_PULLDOWN_ENABLE     set_P1DW_4
#define    P15_PULLDOWN_ENABLE     set_P1DW_5
#define    P16_PULLDOWN_ENABLE     set_P1DW_6
#define    P17_PULLDOWN_ENABLE     set_P1DW_7
#define    P20_PULLDOWN_ENABLE     set_P2DW_0
#define    P21_PULLDOWN_ENABLE     set_P2DW_1
#define    P22_PULLDOWN_ENABLE     set_P2DW_2
#define    P23_PULLDOWN_ENABLE     set_P2DW_3
#define    P24_PULLDOWN_ENABLE     set_P2DW_4
#define    P25_PULLDOWN_ENABLE     set_P2DW_5
#define    P30_PULLDOWN_ENABLE     set_P3DW_0
#define    P31_PULLDOWN_ENABLE     set_P3DW_1
#define    P32_PULLDOWN_ENABLE     set_P3DW_2
#define    P33_PULLDOWN_ENABLE     set_P3DW_3
#define    P34_PULLDOWN_ENABLE     set_P3DW_4
#define    P35_PULLDOWN_ENABLE     set_P3DW_5
#define    P36_PULLDOWN_ENABLE     set_P3DW_6
#define    P37_PULLDOWN_ENABLE     set_P3DW_7
/*------------------ GPIO pull down disable -------------------*/
#define    P00_PULLDOWN_DISABLE    clr_P0DW_0
#define    P01_PULLDOWN_DISABLE    clr_P0DW_1
#define    P02_PULLDOWN_DISABLE    clr_P0DW_2
#define    P03_PULLDOWN_DISABLE    clr_P0DW_3
#define    P04_PULLDOWN_DISABLE    clr_P0DW_4
#define    P05_PULLDOWN_DISABLE    clr_P0DW_5
#define    P06_PULLDOWN_DISABLE    clr_P0DW_6
#define    P07_PULLDOWN_DISABLE    clr_P0DW_7
#define    P10_PULLDOWN_DISABLE    clr_P1DW_0
#define    P11_PULLDOWN_DISABLE    clr_P1DW_1
#define    P12_PULLDOWN_DISABLE    clr_P1DW_2
#define    P13_PULLDOWN_DISABLE    clr_P1DW_3
#define    P14_PULLDOWN_DISABLE    clr_P1DW_4
#define    P15_PULLDOWN_DISABLE    clr_P1DW_5
#define    P16_PULLDOWN_DISABLE    clr_P1DW_6
#define    P17_PULLDOWN_DISABLE    clr_P1DW_7
#define    P20_PULLDOWN_DISABLE    clr_P2DW_0
#define    P21_PULLDOWN_DISABLE    clr_P2DW_1
#define    P22_PULLDOWN_DISABLE    clr_P2DW_2
#define    P23_PULLDOWN_DISABLE    clr_P2DW_3
#define    P24_PULLDOWN_DISABLE    clr_P2DW_4
#define    P25_PULLDOWN_DISABLE    clr_P2DW_5
#define    P30_PULLDOWN_DISABLE    clr_P3DW_0
#define    P31_PULLDOWN_DISABLE    clr_P3DW_1
#define    P32_PULLDOWN_DISABLE    clr_P3DW_2
#define    P33_PULLDOWN_DISABLE    clr_P3DW_3
#define    P34_PULLDOWN_DISABLE    clr_P3DW_4
#define    P35_PULLDOWN_DISABLE    clr_P3DW_5
#define    P36_PULLDOWN_DISABLE    clr_P3DW_6
#define    P37_PULLDOWN_DISABLE    clr_P3DW_7

/*****************************************************************************************
*  GPIO TTL/Schmitt Trig Type Define
*****************************************************************************************/
//------------------- Enable GPIO Schmitt Trigger Mode  -------------------
#define    P00_ST_ENABLE          SFRS=1;P0S|=0x01
#define    P01_ST_ENABLE          SFRS=1;P0S|=0x02
#define    P02_ST_ENABLE          SFRS=1;P0S|=0x04
#define    P03_ST_ENABLE          SFRS=1;P0S|=0x08
#define    P04_ST_ENABLE          SFRS=1;P0S|=0x10
#define    P05_ST_ENABLE          SFRS=1;P0S|=0x20
#define    P06_ST_ENABLE          SFRS=1;P0S|=0x40
#define    P07_ST_ENABLE          SFRS=1;P0S|=0x80
#define    P10_ST_ENABLE          SFRS=1;P1S|=0x01
#define    P11_ST_ENABLE          SFRS=1;P1S|=0x02
#define    P12_ST_ENABLE          SFRS=1;P1S|=0x04
#define    P13_ST_ENABLE          SFRS=1;P1S|=0x08
#define    P14_ST_ENABLE          SFRS=1;P1S|=0x10
#define    P15_ST_ENABLE          SFRS=1;P1S|=0x20
#define    P16_ST_ENABLE          SFRS=1;P1S|=0x40
#define    P17_ST_ENABLE          SFRS=1;P1S|=0x80
#define    P20_ST_ENABLE          SFRS=1;P2S|=0x01
#define    P21_ST_ENABLE          SFRS=1;P2S|=0x02
#define    P22_ST_ENABLE          SFRS=1;P2S|=0x04
#define    P23_ST_ENABLE          SFRS=1;P2S|=0x08
#define    P24_ST_ENABLE          SFRS=1;P2S|=0x10
#define    P25_ST_ENABLE          SFRS=1;P2S|=0x20
#define    P26_ST_ENABLE          SFRS=1;P2S|=0x40
#define    P27_ST_ENABLE          SFRS=1;P2S|=0x80
#define    P30_ST_ENABLE          SFRS=1;P3S|=0x01
#define    P31_ST_ENABLE          SFRS=1;P3S|=0x02
#define    P32_ST_ENABLE          SFRS=1;P3S|=0x04
#define    P33_ST_ENABLE          SFRS=1;P3S|=0x08
#define    P34_ST_ENABLE          SFRS=1;P3S|=0x10
#define    P35_ST_ENABLE          SFRS=1;P3S|=0x20
#define    P36_ST_ENABLE          SFRS=1;P3S|=0x40
#define    P37_ST_ENABLE          SFRS=1;P3S|=0x80
#define    P40_ST_ENABLE          SFRS=1;P4S|=0x01
#define    P41_ST_ENABLE          SFRS=1;P4S|=0x02
#define    P42_ST_ENABLE          SFRS=1;P4S|=0x04
#define    P43_ST_ENABLE          SFRS=1;P4S|=0x08
#define    P44_ST_ENABLE          SFRS=1;P4S|=0x10
#define    P45_ST_ENABLE          SFRS=1;P4S|=0x20
#define    P46_ST_ENABLE          SFRS=1;P4S|=0x40
#define    P47_ST_ENABLE          SFRS=1;P4S|=0x80
#define    P50_ST_ENABLE          SFRS=1;P5S|=0x01
#define    P51_ST_ENABLE          SFRS=1;P5S|=0x02
#define    P52_ST_ENABLE          SFRS=1;P5S|=0x04
#define    P53_ST_ENABLE          SFRS=1;P5S|=0x08
#define    P54_ST_ENABLE          SFRS=1;P5S|=0x10
#define    P55_ST_ENABLE          SFRS=1;P5S|=0x20
#define    P56_ST_ENABLE          SFRS=1;P5S|=0x40
#define    P57_ST_ENABLE          SFRS=1;P5S|=0x80
#define    P60_ST_ENABLE          SFRS=2;P6S|=0x01
#define    P61_ST_ENABLE          SFRS=2;P6S|=0x02
#define    P62_ST_ENABLE          SFRS=2;P6S|=0x04
#define    P63_ST_ENABLE          SFRS=2;P6S|=0x08
#define    P64_ST_ENABLE          SFRS=2;P6S|=0x10
#define    P65_ST_ENABLE          SFRS=2;P6S|=0x20
#define    P66_ST_ENABLE          SFRS=2;P6S|=0x40
#define    P67_ST_ENABLE          SFRS=2;P6S|=0x80

//------------------- Enable GPIO TTL Mode  -------------------
#define    P00_TTL_ENABLE          SFRS=1;P0S&=0xFE
#define    P01_TTL_ENABLE          SFRS=1;P0S&=0xFD
#define    P02_TTL_ENABLE          SFRS=1;P0S&=0xFB
#define    P03_TTL_ENABLE          SFRS=1;P0S&=0xF7
#define    P04_TTL_ENABLE          SFRS=1;P0S&=0xEF
#define    P05_TTL_ENABLE          SFRS=1;P0S&=0xDF
#define    P06_TTL_ENABLE          SFRS=1;P0S&=0xBF
#define    P07_TTL_ENABLE          SFRS=1;P0S&=0x7F
#define    P10_TTL_ENABLE          SFRS=1;P1S&=0xFE
#define    P11_TTL_ENABLE          SFRS=1;P1S&=0xFD
#define    P12_TTL_ENABLE          SFRS=1;P1S&=0xFB
#define    P13_TTL_ENABLE          SFRS=1;P1S&=0xF7
#define    P14_TTL_ENABLE          SFRS=1;P1S&=0xEF
#define    P15_TTL_ENABLE          SFRS=1;P1S&=0xDF
#define    P16_TTL_ENABLE          SFRS=1;P1S&=0xBF
#define    P17_TTL_ENABLE          SFRS=1;P1S&=0x7F
#define    P20_TTL_ENABLE          SFRS=1;P2S&=0xFE
#define    P21_TTL_ENABLE          SFRS=1;P2S&=0xFD
#define    P22_TTL_ENABLE          SFRS=1;P2S&=0xFB
#define    P23_TTL_ENABLE          SFRS=1;P2S&=0xF7
#define    P24_TTL_ENABLE          SFRS=1;P2S&=0xEF
#define    P25_TTL_ENABLE          SFRS=1;P2S&=0xDF
#define    P26_TTL_ENABLE          SFRS=1;P2S&=0xBF
#define    P27_TTL_ENABLE          SFRS=1;P2S&=0x7F
#define    P30_TTL_ENABLE          SFRS=1;P3S&=0xFE
#define    P31_TTL_ENABLE          SFRS=1;P3S&=0xFD
#define    P32_TTL_ENABLE          SFRS=1;P3S&=0xFB
#define    P33_TTL_ENABLE          SFRS=1;P3S&=0xF7
#define    P34_TTL_ENABLE          SFRS=1;P3S&=0xEF
#define    P35_TTL_ENABLE          SFRS=1;P3S&=0xDF
#define    P36_TTL_ENABLE          SFRS=1;P3S&=0xBF
#define    P37_TTL_ENABLE          SFRS=1;P3S&=0x7F
#define    P40_TTL_ENABLE          SFRS=1;P4S&=0xFE
#define    P41_TTL_ENABLE          SFRS=1;P4S&=0xFD
#define    P42_TTL_ENABLE          SFRS=1;P4S&=0xFB
#define    P43_TTL_ENABLE          SFRS=1;P4S&=0xF7
#define    P44_TTL_ENABLE          SFRS=1;P4S&=0xEF
#define    P45_TTL_ENABLE          SFRS=1;P4S&=0xDF
#define    P46_TTL_ENABLE          SFRS=1;P4S&=0xBF
#define    P47_TTL_ENABLE          SFRS=1;P4S&=0x7F
#define    P50_TTL_ENABLE          SFRS=1;P5S&=0xFE
#define    P51_TTL_ENABLE          SFRS=1;P5S&=0xFD
#define    P52_TTL_ENABLE          SFRS=1;P5S&=0xFB
#define    P53_TTL_ENABLE          SFRS=1;P5S&=0xF7
#define    P54_TTL_ENABLE          SFRS=1;P5S&=0xEF
#define    P55_TTL_ENABLE          SFRS=1;P5S&=0xDF
#define    P56_TTL_ENABLE          SFRS=1;P5S&=0xBF
#define    P57_TTL_ENABLE          SFRS=1;P5S&=0x7F
#define    P60_TTL_ENABLE          SFRS=2;P6S&=0xFE
#define    P61_TTL_ENABLE          SFRS=2;P6S&=0xFD
#define    P62_TTL_ENABLE          SFRS=2;P6S&=0xFB
#define    P63_TTL_ENABLE          SFRS=2;P6S&=0xF7
#define    P64_TTL_ENABLE          SFRS=2;P6S&=0xEF
#define    P65_TTL_ENABLE          SFRS=2;P6S&=0xDF
#define    P66_TTL_ENABLE          SFRS=2;P6S&=0xBF
#define    P67_TTL_ENABLE          SFRS=2;P6S&=0x7F
